ARMmbed/mbed-os/targets/TARGET_Geehy/TARGET_APM32F4XX/device/apm32f4xx_libopt.h
/*!
 * @file        apm32f4xx_libopt.h
 *
 * @brief       CMSIS Cortex-M4 Device Peripheral Access Layer System Source File
 *
 * @version     V1.0.0
 *
 * @date        2023-11-30
 *
 * @attention
 *
 *  Copyright (C) 2021-2023 Geehy Semiconductor
 *
 *  You may not use this file except in compliance with the
 *  GEEHY COPYRIGHT NOTICE (GEEHY SOFTWARE PACKAGE LICENSE).
 *
 *  The program is only for reference, which is distributed in the hope
 *  that it will be useful and instructional for customers to develop
 *  their software. Unless required by applicable law or agreed to in
 *  writing, the program is distributed on an "AS IS" BASIS, WITHOUT
 *  ANY WARRANTY OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the GEEHY SOFTWARE PACKAGE LICENSE for the governing permissions
 *  and limitations under the License.
 */

#ifndef APM32F4XX_LIBOPT_H
#define APM32F4XX_LIBOPT_H

#if defined (APM32F407)
#include "apm32f4xx_adc.h"
#include "apm32f4xx_can.h"
#include "apm32f4xx_comp.h"
#include "apm32f4xx_crc.h"
#include "apm32f4xx_cryp.h"
#include "apm32f4xx_dac.h"
#include "apm32f4xx_dbgmcu.h"
#include "apm32f4xx_dci.h"
#include "apm32f4xx_dma.h"
#include "apm32f4xx_dmc.h"
#include "apm32f4xx_eint.h"
#include "apm32f4xx_fmc.h"
#include "apm32f4xx_gpio.h"
#include "apm32f4xx_hash.h"
#include "apm32f4xx_i2c.h"
#include "apm32f4xx_iwdt.h"
#include "apm32f4xx_misc.h"
#include "apm32f4xx_pmu.h"
#include "apm32f4xx_qspi.h"
#include "apm32f4xx_rcm.h"
#include "apm32f4xx_rng.h"
#include "apm32f4xx_rtc.h"
#include "apm32f4xx_sdio.h"
#include "apm32f4xx_smc.h"
#include "apm32f4xx_spi.h"
#include "apm32f4xx_syscfg.h"
#include "apm32f4xx_tmr.h"
#include "apm32f4xx_usart.h"
#include "apm32f4xx_usb.h"
#include "apm32f4xx_usb_device.h"
#include "apm32f4xx_usb_host.h"
#include "apm32f4xx_wwdt.h"
#include "apm32f4xx_eth.h"
#endif

#endif /* APM32F4XX_LIBOPT_H */
